{
  "containers": [
    {
      "title": "Moduły związane z postaciami",
      "modules": [
        {
          "name": "CharacterEffect",
          "tipInfo": "Umożliwia tworzenie danych efektów na postaciach gracza, fakeNPC, NPC, czy potworach."
        },
        {
          "name": "FakeNpc",
          "tipInfo": "Umożliwia tworzenie poruszających się npc w konkretnych miejscach, wykonujących konkretne zachowania."
        },
        {
          "name": "CallInstantBehaviorFakeNpc",
          "tipInfo": "Umożliwia nadpisanie aktualnego zachowania FakeNpc. Po jego wykonaniu fakeNpc powróci do swojego orygianlnego zachowania."
        },
        {
          "name": "CharacterHide",
          "tipInfo": "Umożliwia ukrywanie fakeNPC, HERO, Peta, NPC na mapie, minimapie oraz opcjonalnie ich tipu po najechaniu na chowany obiekt."
        },
        {
          "name": "EmoDefinitions",
          "tipInfo": "Umożliwia deklarację niestandardowego dymku. Stosować tylko i wyłącznie w połączeniu z emoActions."
        },
        {
          "name": "EmoActions",
          "tipInfo": "Umożliwia podpięcie wcześniej zadeklarowanego dymku do NPC. Stosować tylko i wyłącznie w połączeniu z emoDefinitions."
        }
      ]
    },
    {
      "title": "Moduły związane z mapą",
      "modules": [
        {
          "name": "Weather",
          "tipInfo": "Umożliwia stworzenie pogody (jednej lub kilku naraz) na mapie. Pozwala także definiować kierunek oraz prędkość poruszania się generowanych obiektów."
        },
        {
          "name": "EarthQuake",
          "tipInfo": "Powoduje trzęsienie się okna gry oraz elementów na mapie."
        },
        {
          "name": "MapFilter",
          "tipInfo": "Umożliwia nałożenie filtru o danym kolorze na ekran gracza."
        },
        {
          "name": "Night",
          "tipInfo": "Umożliwia stworzenie nocy opcjonalnie z cyklem dobowym, mgły czy innego filtru nałożonego na ekran wraz z wyciętymi dziurami oraz światłami."
        },
        {
          "name": "ExtraLight",
          "tipInfo": "Umożliwia tworzenie dodatkowych dziur i świateł na mapie, które nie zostały zadeklarowane w kluczu night. To światło można również przypisać do danego npc."
        },
        {
          "name": "DynamicLight",
          "tipInfo": "Umożliwia stworzenie dziur oraz świateł, które będą się poruszać wraz z daną postacią (fakeNPC lub Hero)."
        },
        {
          "name": "ScreenEffects",
          "tipInfo": "Umożliwia stworzenie przyciemnień na ekranie, przechodzenia z jednego backgroundu w drugi, błysk flesza, poruszania dziurami po ekranie i nakładanie na siebie kilku efektów."
        },
        {
          "name": "FloatForeground",
          "tipInfo": "Umożliwia tworzenie przesuwającego się wzorca powtarzalnego. Można za pomocą tego zrobić mgłę, chmury, zorzę, burzę pustynną, smog, itp."
        },
        {
          "name": "FloatObject",
          "tipInfo": "Umożliwia tworzenie przesuwających się obiektów, które nie zwracają uwagi na kolizje i mogą się poruszać po całej mapie bez ograniczeń."
        },
        {
          "name": "Programmer",
          "tipInfo": "Umożliwia wyzwolenie SRAJa w konkretnym momencie, o konkretnych godzinach, powtarzające się o danym czasie, itd."
        },
        {
          "name": "MapEvents",
          "tipInfo": "Umożliwia wywołanie SRAJa wraz ze śmiercią danego NPC, który będzie widoczny dla wszystkich graczy na mapie."
        },
        {
          "name": "Sound",
          "tipInfo": "Umożliwia stworzenie dźwięku na mapie opcjonalnie podając jego źródło, zasięg oraz głośność."
        },
        {
          "name": "AreaTrigger",
          "tipInfo": "Umożliwia odpalenie wybranego Sraja po wejściu na dane kordy lub po wejściu w dany obszar."
        },
        {
          "name": "MapMusic",
          "tipInfo": "Umożliwia przypisanie muzyki do danej mapy, żeby były odtwarzane zamiast tego, który jest pobierany z battleGroundu mapy."
        }
      ]
    },
    {
      "title": "Moduły związane z dialogiem",
      "modules": [
        {
          "name": "Dialogue",
          "tipInfo": "Umożliwia zmianę nagłówka okna dialogowego na dowolny tekst."
        },
        {
          "name": "Camera",
          "tipInfo": "Umożliwia sterowanie kamerą poprzez przeniesienie jej w dane miejsce, bądź też przypięcie do poruszającego się obiektu."
        },
        {
          "name": "YellowMessage",
          "tipInfo": "Umożliwia wywołanie żółtej wiadomości na środku ekranu."
        },
        {
          "name": "MapExternalPropertiesRefresh",
          "tipInfo": "Umożliwia przeładowanie kluczy SRAJ, które zostały przypisane do mapy. Głównie stosować w połączeniu z case."
        }
      ]
    },
    {
      "title": "Pozostałe",
      "modules": [
        {
          "name": "Interface_skin",
          "tipInfo": "Umożliwia zmianę koloru interfejsu (są problemy z grafiką niektórych elementów - korzystanie niezalecane)."
        },
        {
          "name": "Template",
          "tipInfo": "Umożliwia wykorzystanie zadeklarowanego template w późniejszym kodzie SRAJ. Jeżeli korzystamy z kilku tych samych obiektów, to skraca to objętość kodu i nie zmusza do modyfikacja każdego tworzonego obiektu, a tylko szablonu."
        },
        {
          "name": "WindowEvents",
          "tipInfo": "Umożliwia wywołanie cachowanego SRAJ dla eventów okna. Sraj można dodawać z dialogu i external_propeties mapy. Aktualnie istnieje tylko dwa triggery przy otwieraniu okna. Samo otworzenie okna bez załadowanych danych (ON_OPEN) oraz przy aktualizacji okna (ON_UPDATE). SRAJ windowEvents na tą chwilę działa tylko dla Recept."
        },
        {
          "name": "Sequence",
          "tipInfo": "Umożliwia łańcuchowe wywoływanie efektów po sobie na podstawie czasu. W momencie minięcia duration danego zachowania sekwencja przechodzi do kolejnego lub powtarza aktualne."
        }
      ]
    }
  ]
}